In [1]:
import numpy as np
import pandas as pd

string_data = pd.Series(['板橋區', '中和區', np.nan, '土城區'])
string_data

0    板橋區
1    中和區
2    NaN
3    土城區
dtype: object

In [3]:
#檢查有沒有空的資料
#isnull()
string_data[string_data.isnull()]

2    NaN
dtype: object

In [5]:
#檢查有沒有空的資料
#notnull()
string_data[string_data.notnull()]

0    板橋區
1    中和區
3    土城區
dtype: object

In [7]:
#清除nan資料
#dropna()
string_data = pd.Series(['板橋區', '中和區', np.nan, '土城區'])
string_data

0    板橋區
1    中和區
2    NaN
3    土城區
dtype: object

In [8]:
string_data.dropna()

0    板橋區
1    中和區
3    土城區
dtype: object

In [9]:
#dataFrame
from numpy import nan as NA

data = pd.DataFrame([[1., 6.5, 3.],
                    [1., NA, NA],
                    [NA, NA, NA],
                    [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [17]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  0.655668       NaN       NaN
1  0.379655       NaN       NaN
2 -0.237645       NaN  0.465047
3  0.140595       NaN  0.901171
4 -2.097124  1.393050  0.537724
5  1.333561 -0.664699  0.862946
6 -0.720264 -0.719344  0.794125

In [18]:
#fillna()
df.fillna(0)

          0         1         2
0  0.655668  0.000000  0.000000
1  0.379655  0.000000  0.000000
2 -0.237645  0.000000  0.465047
3  0.140595  0.000000  0.901171
4 -2.097124  1.393050  0.537724
5  1.333561 -0.664699  0.862946
6 -0.720264 -0.719344  0.794125

In [19]:
#移除重複資料
#drop_duplicates()

data = pd.DataFrame({'k1':['one', 'two']*3 + ['two'],
                    'k2':[1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [21]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [22]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [23]:
#置換值
#replace()
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [26]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [30]:
data.replace([-999,-1000],0)

0    1.0
1    0.0
2    2.0
3    0.0
4    0.0
5    3.0
dtype: float64

In [ ]:
#Serial.map(function)